In [40]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [41]:
df=pd.read_csv('top_expensive_leagues.csv')

In [42]:
df.head()

,League ID,League Name,Country,Sport,Revenue (USD),Average Player Salary (USD),Top Team,Total Teams,Founded Year,Viewership
0,L001,Premier League,England,Football,5.275330e+09,12080000.0,Liverpool,16,1886.0,485.90
1,L002,Serie A,India,American Football,7.088640e+09,6730000.0,Inter Milan,13,1977.0,135.01
2,L003,IPL,England,American Football,7.930520e+09,14360000.0,Chennai Super Kings,13,1979.0,157.49
3,L004,La Liga,Spain,American Football,4.972890e+09,13720000.0,Atletico Madrid,22,1999.0,245.71
4,L005,Serie A,Italy,Basketball,6.265740e+09,7450000.0,Juventus,16,1963.0,52.83

In [43]:
df.isnull().sum(
    
)

League ID                      0
League Name                    0
Country                        0
Sport                          0
Revenue (USD)                  0
Average Player Salary (USD)    0
Top Team                       0
Total Teams                    0
Founded Year                   0
Viewership                     4
dtype: int64

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 10 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   League ID                    700 non-null    object
 1   League Name                  700 non-null    object
 2   Country                      700 non-null    object
 3   Sport                        700 non-null    object
 4   Revenue (USD)                700 non-null    float64
 5   Average Player Salary (USD)  700 non-null    object
 6   Top Team                     700 non-null    object
 7   Total Teams                  700 non-null    int64
 8   Founded Year                 700 non-null    float64
 9   Viewership                   696 non-null    float64
dtypes: float64(3), int64(1), object(6)
memory usage: 54.8+ KB

In [45]:
df['Viewership'].fillna(df['Viewership'].mean(),inplace=True)

C:\Users\davro\AppData\Local\Temp\ipykernel_36220\491179418.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Viewership'].fillna(df['Viewership'].mean(),inplace=True)

In [46]:
df.isnull().sum(
    
)

League ID                      0
League Name                    0
Country                        0
Sport                          0
Revenue (USD)                  0
Average Player Salary (USD)    0
Top Team                       0
Total Teams                    0
Founded Year                   0
Viewership                     0
dtype: int64

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 10 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   League ID                    700 non-null    object
 1   League Name                  700 non-null    object
 2   Country                      700 non-null    object
 3   Sport                        700 non-null    object
 4   Revenue (USD)                700 non-null    float64
 5   Average Player Salary (USD)  700 non-null    object
 6   Top Team                     700 non-null    object
 7   Total Teams                  700 non-null    int64
 8   Founded Year                 700 non-null    float64
 9   Viewership                   700 non-null    float64
dtypes: float64(3), int64(1), object(6)
memory usage: 54.8+ KB

In [51]:
len(df['League Name'].value_counts())

8

In [53]:
len(df['League ID'].value_counts())

700

In [56]:
cat_col=df.select_dtypes(include=['object']).columns.to_list()

In [57]:
cat_col

['League ID',
 'League Name',
 'Country',
 'Sport',
 'Average Player Salary (USD)',
 'Top Team']

In [58]:
cardinality = df[cat_col].nunique()

In [59]:
cardinality

League ID                      700
League Name                      8
Country                          7
Sport                            4
Average Player Salary (USD)    542
Top Team                        28
dtype: int64

In [60]:
high_cardinality_columns = [col for col, card in cardinality.items() if card > 10]
low_cardinality_columns = [col for col, card in cardinality.items() if card <= 10]

In [61]:
high_cardinality_columns

['League ID', 'Average Player Salary (USD)', 'Top Team']

In [63]:
low_cardinality_columns

['League Name', 'Country', 'Sport']

In [64]:
df_one_hot = pd.get_dummies(df[low_cardinality_columns], drop_first=True)

In [65]:
df_one_hot.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 16 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   League Name_IPL             700 non-null    bool
 1   League Name_La Liga         700 non-null    bool
 2   League Name_Ligue 1         700 non-null    bool
 3   League Name_NBA             700 non-null    bool
 4   League Name_NFL             700 non-null    bool
 5   League Name_Premier League  700 non-null    bool
 6   League Name_Serie A         700 non-null    bool
 7   Country_France              700 non-null    bool
 8   Country_Germany             700 non-null    bool
 9   Country_India               700 non-null    bool
 10  Country_Italy               700 non-null    bool
 11  Country_Spain               700 non-null    bool
 12  Country_USA                 700 non-null    bool
 13  Sport_Basketball            700 non-null    bool
 14  Sport_Cricket               700 non-null    bool
 15  Sport_Football              700 non-null    bool
dtypes: bool(16)
memory usage: 11.1 KB

In [66]:
df_one_hot = df_one_hot.astype(int)

In [67]:
df = df.drop(columns=low_cardinality_columns).join(df_one_hot)

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 23 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   League ID                    700 non-null    object
 1   Revenue (USD)                700 non-null    float64
 2   Average Player Salary (USD)  700 non-null    object
 3   Top Team                     700 non-null    object
 4   Total Teams                  700 non-null    int64
 5   Founded Year                 700 non-null    float64
 6   Viewership                   700 non-null    float64
 7   League Name_IPL              700 non-null    int64
 8   League Name_La Liga          700 non-null    int64
 9   League Name_Ligue 1          700 non-null    int64
 10  League Name_NBA              700 non-null    int64
 11  League Name_NFL              700 non-null    int64
 12  League Name_Premier League   700 non-null    int64
 13  League Name_Serie A          700 non-null    int64
 14  Country_France               700 non-null    int64
 15  Country_Germany              700 non-null    int64
 16  Country_India                700 non-null    int64
 17  Country_Italy                700 non-null    int64
 18  Country_Spain                700 non-null    int64
 19  Country_USA                  700 non-null    int64
 20  Sport_Basketball             700 non-null    int64
 21  Sport_Cricket                700 non-null    int64
 22  Sport_Football               700 non-null    int64
dtypes: float64(3), int64(17), object(3)
memory usage: 125.9+ KB

In [70]:
high_cardinality_columns

['League ID', 'Average Player Salary (USD)', 'Top Team']

In [71]:
from sklearn.preprocessing import LabelEncoder

In [72]:
label_encoder = LabelEncoder()
df[high_cardinality_columns] = df[high_cardinality_columns].apply(label_encoder.fit_transform)

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 23 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   League ID                    700 non-null    int64
 1   Revenue (USD)                700 non-null    float64
 2   Average Player Salary (USD)  700 non-null    int64
 3   Top Team                     700 non-null    int64
 4   Total Teams                  700 non-null    int64
 5   Founded Year                 700 non-null    float64
 6   Viewership                   700 non-null    float64
 7   League Name_IPL              700 non-null    int64
 8   League Name_La Liga          700 non-null    int64
 9   League Name_Ligue 1          700 non-null    int64
 10  League Name_NBA              700 non-null    int64
 11  League Name_NFL              700 non-null    int64
 12  League Name_Premier League   700 non-null    int64
 13  League Name_Serie A          700 non-null    int64
 14  Country_France               700 non-null    int64
 15  Country_Germany              700 non-null    int64
 16  Country_India                700 non-null    int64
 17  Country_Italy                700 non-null    int64
 18  Country_Spain                700 non-null    int64
 19  Country_USA                  700 non-null    int64
 20  Sport_Basketball             700 non-null    int64
 21  Sport_Cricket                700 non-null    int64
 22  Sport_Football               700 non-null    int64
dtypes: float64(3), int64(20)
memory usage: 125.9 KB

In [74]:
df.head()

,League ID,Revenue (USD),Average Player Salary (USD),Top Team,Total Teams,Founded Year,Viewership,League Name_IPL,League Name_La Liga,League Name_Ligue 1,...,League Name_Serie A,Country_France,Country_Germany,Country_India,Country_Italy,Country_Spain,Country_USA,Sport_Basketball,Sport_Cricket,Sport_Football
0,0,5.275330e+09,74,16,16,1886.0,485.90,0,0,0,...,0,0,0,0,0,0,0,0,0,1
1,1,7.088640e+09,418,13,13,1977.0,135.01,0,0,0,...,1,0,0,1,0,0,0,0,0,0
2,2,7.930520e+09,179,9,13,1979.0,157.49,1,0,0,...,0,0,0,0,0,0,0,0,0,0
3,3,4.972890e+09,146,5,22,1999.0,245.71,0,1,0,...,0,0,0,0,0,1,0,0,0,0
4,4,6.265740e+09,439,14,16,1963.0,52.83,0,0,0,...,1,0,0,0,1,0,0,1,0,0